# Summary of Notebook
    Full set: 206209
    Exported as pickle & saved as cust_ready_to_clean
    Memory: Reduced memory of original file
    Datatype:
        Changed the datatypes: Note user_id = int32
    Null: Null only in first_name column
    Duplicates:  No duplicates found
    Statistics:
        Age, Dependents, Income in reasonable range
    Column Notes:
        state looks reasonable
        gender looks reasonable
        living_situation may have issues. Interpretation may be sketcy: overlap possible with categories - divorced/widowed may also be single, married with parents and siblings may also be single

In [1]:
#importing libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy
import datetime as dt

In [2]:
#import csv customers dataframe
df_cust = pd.read_csv(r'C:\Users\Selena\Desktop\3-22 Instacart Basket Analysis\02 Data\Original Data\customers.csv')
path = r'C:\Users\Selena\Desktop\3-22 Instacart Basket Analysis'
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [5]:
#getting to know the dataframe
df_cust.shape

(206209, 10)

In [6]:
#seeing the type of data and columns
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [7]:
#seeing the columns and data
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
#seeing the end of the columns and data
df_cust.tail()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

In [9]:
#renaming for consistency
df_cust.rename(columns={'First Name': 'first_name', 'Surnam': 'last_name', 'Gender':'gender', 'STATE': 'state', 'Age':'age', 'n_dependants':'dependents', 'fam_status':'living_situation'}, inplace=True)

In [10]:
#checking for change

In [12]:
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,dependents,living_situation,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [13]:
#seeing info again
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   user_id           206209 non-null  int64
 1   first_name        194950 non-null  object
 2   last_name         206209 non-null  object
 3   gender            206209 non-null  object
 4   state             206209 non-null  object
 5   age               206209 non-null  int64
 6   date_joined       206209 non-null  object
 7   dependents        206209 non-null  int64
 8   living_situation  206209 non-null  object
 9   income            206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [14]:
#changing datatype to reduce memory - changing objects to category
df_cust[['first_name', 'last_name','gender','state','living_situation']] = df_cust[['first_name','last_name','gender','state','living_situation']].astype('category')

In [15]:
#changing to date variable
df_cust['date_joined'] = df_cust['date_joined'].astype('datetime64')

In [16]:
#seeing what kind of interger type is best
df_cust.describe()

             user_id            age     dependents         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [17]:
#changing datatype to reduce memory - datatype int16
df_cust[['age', 'dependents']] = df_cust[['age', 'dependents']].astype("int16")

In [18]:
#changing datatype to reduce memory - datatype int32
df_cust[['user_id', 'income']] = df_cust[['user_id', 'income']].astype("int32")

In [19]:
#checking dataframe
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   user_id           206209 non-null  int32
 1   first_name        194950 non-null  category
 2   last_name         206209 non-null  category
 3   gender            206209 non-null  category
 4   state             206209 non-null  category
 5   age               206209 non-null  int16
 6   date_joined       206209 non-null  datetime64[ns]
 7   dependents        206209 non-null  int16
 8   living_situation  206209 non-null  category
 9   income            206209 non-null  int32
dtypes: category(5), datetime64[ns](1), int16(2), int32(2)
memory usage: 5.4 MB

# Notes on memory change:  change happened

In [20]:
#seeing if any data is missing
df_cust.isnull().sum()

user_id                 0
first_name          11259
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
dependents              0
living_situation        0
income                  0
dtype: int64

# Notes on null findings: first_name has missing data

In [21]:
#looking for duplicates
(df_cust.duplicated().value_counts())

False    206209
dtype: int64

# Notes on duplicates: no duplicates found

In [22]:
#checking to see if there is anything goofy with states
pivot = df_cust.pivot_table(index =['state'],
                       values =['income'],
                       aggfunc ='sum')
print(pivot)

                         income
state
Alabama               379861988
Alaska                381823377
Arizona               384110828
Arkansas              382629433
California            383853807
Colorado              381500766
Connecticut           385685459
Delaware              380163215
District of Columbia  384015773
Florida               376411078
Georgia               378538977
Hawaii                384002737
Idaho                 377961686
Illinois              381691124
Indiana               386157171
Iowa                  382512707
Kansas                380286975
Kentucky              380366876
Louisiana             389574600
Maine                 381187276
Maryland              380914429
Massachusetts         380737399
Michigan              383357712
Minnesota             385844137
Mississippi           381488156
Missouri              386099435
Montana               383013223
Nebraska              381716834
Nevada                380399692
New Hampshire         384009842
New Jersey            385637500
New Mexico            378695170
New York              384770293
North Carolina        382515625
North Dakota          382380129
Ohio                  385873346
Oklahoma              381377530
Oregon                375874550
Pennsylvania          384491225
Rhode Island          382197609
South Carolina        382941025
South Dakota          385820311
Tennessee             380813255
Texas                 382265261
Utah                  383450063
Vermont               387187472
Virginia              385174123
Washington            384006435
West Virginia         382405064
Wisconsin             381103957
Wyoming               385249236

# Notes on Pivot Column state: Quick glance, nothing out of the ordinary

In [23]:
#checking the gender column
pivot = df_cust.pivot_table(index =['gender'],
                       values =['income'],
                       aggfunc ='sum')
print(pivot)

              income
gender
Female  9.670768e+09
Male    9.843378e+09

# Notes on Pivot Column gender: Nothing out of the ordinary

In [24]:
#checking the living_situation column
pivot = df_cust.pivot_table(index =['living_situation'],
                       values =['income'],
                       aggfunc ='sum')
print(pivot)

                                        income
living_situation
divorced/widowed                  1.935254e+09
living with parents and siblings  6.555248e+08
married                           1.397935e+10
single                            2.944013e+09

# Notes on Pivot Column living situation: categories may be overlapping - divorced/widowed may also be single, married with parents and siblins may also be single

In [25]:
#exporting the file as a pickle
df_cust.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'cust_ready_to_clean.pkl'))